{
	"CPSC 254": {
		"title": "Software Development with Open Source Systems",
		"description": "Philosophy of open source software development, open source operating systems such as Linux; open source development tools; open source programming languages, such as Python; open source software development processes; open source software licensing issues. (2 hours lecture, 2 hours laboratory)",
		"prerequisites": [
			"Prerequisites: CPSC 131; Computer Science or Computer Engineering major or minor."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 301": {
		"title": "Programming Lab Practicum",
		"description": "Intensive programming covering concepts learned in lower-division courses. Procedural and object oriented design, documentation, arrays, classes, file input/output, recursion, pointers, dynamic variables, data and file structures.",
		"prerequisites": [
			"Prerequisites: CPSC 131; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 2
	},
	"CPSC 349": {
		"title": "Web Front-End Engineering",
		"description": "Concepts and architecture of interactive web applications, including markup, stylesheets and behavior. Functional and object-oriented aspects of JavaScript. Model-view design patterns, templates and frameworks. Client-side technologies for asynchronous events, real-time interaction and access to back-end web services.",
		"prerequisites": ["CPSC 131 or Computer Science or Computer Engineering graduate standing."],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 375": {
		"title": "Introduction to Data Science and Big Data",
		"description": "Techniques for data preparation, exploratory analysis, statistical modeling, machine learning and visualization. Methods for analyzing different types of data, such as natural language and time-series, from emerging applications, including Internet-of-Things. Big data platforms. Projects with real-world data.",
		"prerequisites": ["Prerequisites: CPSC 131", "MATH 338."],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 386": {
		"title": "Introduction to Game Design and Production",
		"description": "Current and future technologies and market trends in game design and production. Game technologies, basic building tools for games and the process of game design, development and production.",
		"prerequisites": [
			"Prerequisites: CPSC 121; completion of G.E. Category B.4; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 411": {
		"title": "Mobile Device Application Programming",
		"description": "Introduction to developing applications for mobile devices, including but not limited to runtime environments, development tools and debugging tools used in creating applications for mobile devices. Use emulators in lab. Students must provide their own mobile devices.",
		"prerequisites": ["CPSC 131 or Computer Science or Computer Engineering graduate standing."],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 431": {
		"title": "Database and Applications",
		"description": "Database design and application development techniques for a real world system. System analysis, requirement specifications, conceptual modeling, logic design, physical design and web interface development. Develop projects using contemporary database management system and web-based application development platform.",
		"prerequisites": [
			"Prerequisites: CPSC 332; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 439": {
		"title": "Theory of Computation",
		"description": "Introduction to the theory of computation. Automata theory; finite state machines, context free grammars, and Turing machines; hierarchy of formal language classes. Computability theory and undecidable problems. Time complexity; P and NP-complete problems. Applications to software design and security.",
		"prerequisites": [
			"Prerequisites: CPSC 121 or MATH 320; MATH 270B or MATH 280; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 440": {
		"title": "Computer System Architecture",
		"description": "Computer performance, price/performance, instruction set design and examples. Processor design, pipelining, memory hierarchy design and input/output subsystems.",
		"prerequisites": [
			"Prerequisites: CPSC 240; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 449": {
		"title": "Web Back-End Engineering",
		"description": "Design and architecture of large-scale web applications. Techniques for scalability, session management and load balancing. Dependency injection, application tiers, message queues, web services and REST architecture. Caching and eventual consistency. Data models, partitioning and replication in relational and non-relational databases.",
		"prerequisites": ["CPSC 332 or Computer Science or Computer Engineering graduate standing."],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 452": {
		"title": "Cryptography",
		"description": "Introduction to cryptography and steganography. Encryption, cryptographic hashing, certificates, and signatures. Classical, symmetric-key, and public-key ciphers. Block modes of operation. Cryptanalysis including exhaustive search, man-in-the-middle, and birthday attacks. Programing projects involving implementation of cryptographic systems.",
		"prerequisites": [
			"Prerequisites: MATH 270B",
			"CPSC 131; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 454": {
		"title": "Cloud Computing and Security",
		"description": "Cloud computing and cloud security, distributed computing, computer clusters, grid computing, virtual machines and virtualization, cloud computing platforms and deployment models, cloud programming and software environments, vulnerabilities and risks of cloud computing, cloud infrastructure protection, data privacy and protection.",
		"prerequisites": [
			"Prerequisites: CPSC 351",
			"CPSC 353; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 455": {
		"title": "Web Security",
		"description": "Concepts of web application security. Web security mechanisms, including authentication, access control and protecting sensitive data. Common vulnerabilities, including code and SQL attacks, cross-site scripting and cross-site request forgery. Implement hands-on web application security mechanisms and security testing.",
		"prerequisites": [
			"Prerequisites: CPSC 351 or CPSC 353; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 456": {
		"title": "Network Security Fundamentals",
		"description": "Learn about vulnerabilities of network protocols, attacks targeting confidentiality, integrity and availability of data transmitted across networks, and methods for diagnosing and closing security gaps through hands-on exercises.",
		"prerequisites": [
			"Prerequisites: CPSC 351; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 458": {
		"title": "Malware Analysis",
		"description": "Introduction to principles and practices of malware analysis. Topics include static and dynamic code analysis, data decoding, analysis tools, debugging, shellcode analysis, reverse engineering of stealthy malware and written presentation of analysis results.",
		"prerequisites": ["CPSC 351 or Computer Science or Computer Engineering graduate standing."],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 459": {
		"title": "Blockchain Technologies",
		"description": "Digital assets as a medium of exchange to secure financial transactions; decentralized and distributed ledgers that record verifiable transactions; smart contracts and Ethereum; Bitcoin mechanics and mining; the cryptocurrency ecosystem; blockchain mechanics and applications.",
		"prerequisites": [
			"Prerequisites: CPSC 351",
			"CPSC 353 or CPSC 452; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 462": {
		"title": "Software Design",
		"description": "Concepts of software modeling, software process and some tools. Object-oriented analysis and design and Unified process. Some computer-aided software engineering (CASE) tools will be recommended to use for doing homework assignments.",
		"prerequisites": [
			"Prerequisites: CPSC 362; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 463": {
		"title": "Software Testing",
		"description": "Software testing techniques, reporting problems effectively and planning testing projects. Students apply what they learned throughout the course to a sample application that is either commercially available or under development.",
		"prerequisites": [
			"Prerequisites: CPSC 362; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 464": {
		"title": "Software Architecture",
		"description": "Basic principles and practices of software design and architecture. High-level design, software architecture, documenting software architecture, software and architecture evaluation, software product lines and some considerations beyond software architecture.",
		"prerequisites": [
			"Prerequisites: CPSC 362; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 466": {
		"title": "Software Process",
		"description": "Practical guidance for improving the software development process. How to establish, maintain and improve software processes. Exposure to agile processes, ISO 12207 and CMMI.",
		"prerequisites": ["CPSC 362 or Computer Science or Computer Engineering graduate standing."],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 474": {
		"title": "Parallel and Distributed Computing",
		"description": "Concepts of distributed computing; distributed memory and shared memory architectures; parallel programming techniques; inter-process communication and synchronization; programming for parallel architectures such as multi-core and GPU platforms; project involving distributed application development.",
		"prerequisites": [
			"Prerequisites: CPSC 351; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 479": {
		"title": "Introduction to High Performance Computing",
		"description": "Introduction to the concepts of high-performance computing and the paradigms of parallel programming in a high level programming language, design and implementation of parallel algorithms on distributed memory, machine learning techniques on large data sets, implementation of parallel algorithms.",
		"prerequisites": [
			"Prerequisites: CPSC 351 Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 483": {
		"title": "Introduction to Machine Learning",
		"description": "Design, implement and analyze machine learning algorithms, including supervised learning and unsupervised learning algorithms. Methods to address uncertainty. Projects with real-world data.",
		"prerequisites": [
			"Prerequisites: CPSC 335",
			"MATH 338; Computer Science or Computer Engineering major or minor; or Computer Science or Computer engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 484": {
		"title": "Principles of Computer Graphics",
		"description": "Examine and analyze computer graphics, software structures, display processor organization, graphical input/output devices, display files. Algorithmic techniques for clipping, windowing, character generation and viewpoint transformation.",
		"prerequisites": [
			"Prerequisites: CPSC 131",
			"MATH 150B",
			"MATH 270B",
			"junior or senior standing; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 485": {
		"title": "Computational Bioinformatics",
		"description": "Algorithmic approaches to biological problems. Specific topics include motif finding, genome rearrangement, DNA sequence comparison, sequence alignment, DNA sequencing, repeat finding and gene expression analysis.",
		"prerequisites": [
			"Prerequisites: CPSC 131; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 486": {
		"title": "Game Programming",
		"description": "Survey of data structures and algorithms used for real-time rendering and computer game programming. Build upon existing mathematics and programming knowledge to create interactive graphics programs.",
		"prerequisites": [
			"Prerequisites: CPSC 386",
			"CPSC 484; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 489": {
		"title": "Game Development Project",
		"description": "Individually or in teams, students design, plan and build a computer game.",
		"prerequisites": [
			"Prerequisites: CPSC 486; Computer Science or Computer Engineering major or minor; or Computer Science or Computer Engineering graduate standing."
		],
		"corequisites": [],
		"credits": 3
	},
	"CPSC 499": {
		"title": "Independent Study",
		"description": "Special topic in computer science, selected in consultation with and completed under the supervision of instructor. May be repeated for a maximum of 9 units of Undergraduate credit and 6 units of Graduate credit. Requires approval by the Computer Science chair.",
		"prerequisites": [],
		"corequisites": [],
		"credits": [1, 3]
	},
	"EGGN 495": {
		"title": "Professional Practice",
		"description": "Professional engineering work in industry or government. Written report required. May be taken for credit for a maximum of three units. Applicable towards bachelor’s degree programs. Not for credit in the graduate program.",
		"prerequisites": ["Prerequisites: Engineering major; junior or senior standing."],
		"corequisites": [],
		"credits": [1, 3]
	},
	"MATH 335": {
		"title": "Mathematical Probability",
		"description": "Probability theory; discrete, continuous and multivariate probability distributions, independence, conditional probability distribution, expectation, moment generating functions, functions of random variables and the central limit theorem.",
		"prerequisites": ["MATH 250A with a C (2.0) or better."],
		"corequisites": [],
		"credits": 3
	},
	"MATH 340": {
		"title": "Numerical Analysis",
		"description": "Approximate numerical solutions of systems of linear and nonlinear equations, interpolation theory, numerical differentiation and integration, numerical solution of ordinary differential equations. Computer coding of numerical methods.",
		"prerequisites": ["Prerequisites: MATH 250B; MATH 320", "CPSC 120 or CPSC 121."],
		"corequisites": [],
		"credits": 3
	},
	"MATH 370": {
		"title": "Mathematical Model Building",
		"description": "Introduction to mathematical models in science and engineering: dimensional analysis, discrete and continuous dynamical systems, flow and diffusion models.",
		"prerequisites": ["Prerequisites: MATH 250B; MATH 320", "CPSC 120 or CPSC 121."],
		"corequisites": [],
		"credits": 3
	}
}
